Revit 2027 API
ExternalApplicationArray.Clear Method
Removes every item from the array, rendering it empty.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
public:
virtual void Clear()
abstract Clear : unit -> unit
override Clear : unit -> unit
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace